package com.webill.core.model.dianhuabang;


public enum DianHuaBangErrorCode {
	S0(0, "成功"),
	P3001(3001, "查询中"),
	P3100(3100, "查询失败"),
	P3101(3101, "数据生成中"),
	P3102(3102, "数据生成失败"),
	P3997(3997, "账号授权已过期,请联系运营人员"),
	P3998(3998, "无效的appid"),
	P3999(3999, "token生成失败"),
	F4000(4000, "无效的token"),
	F4001(4001, "api参数错误"),
	F4004(4004, "会话已超时"),
	F4005(4005, "api签名错误"),
	F4006(4006, "运营商短信发送失败,请稍后重试"),
	F4007(4007, "运营商繁忙,请稍后重试"),
	F4008(4008, "验证码错误,请输入正确的验证码"),
	F4009(4009, "运营商提示:短信下发次数已达到上限,请明天重试"),
	F4010(4010, "姓名或身份证号错误"),
	F4012(4012, "手机号或服务密码错误"),
	F4016(4016, "无效会话"),
	F4017(4017, "运营商提示:您已在别处登录。请重新登录"),
	F4990(4990, "上条短信验证码尚在有效期内,请正确输入上条短信验证码"),
	E9999(9999, "系统繁忙,请稍后重试"),
	E20005(20005, "运营商提示:操作过于频繁,请稍等30分钟后重试"),
	E20006(20006, "服务密码错误次数超限"),
	E20008(20008, "运营商禁止非实名用户查询"),
	E20011(20011, "运营商提示:操作过于频繁,为保障您的账户安全,请明天重试"),
	E20013(20013, "短信验证码错误或过期,新验证码已下发,请提交新的验证码"),
	E20014(20014, "运营商提示:不支持初始密码登录,请重置密码后重试"),
	E20015(20015, "运营商禁止该手机办理此业务"),
	E20016(20016, "运营商禁止查询该月详单，可能是过户前的信息，或者是其它特殊禁止查询情况"),
	E20018(20018, "此号码正在查询中,请稍后重试"),
	E20019(20019, "运营商提示：输错次数过多，账号暂时锁定，请明天重试"),
	E30001(30001, "运营商暂不支持该地区服务密码在线重置，如需重置，请拨打客服热线"),
	E30002(30002, "请输入 8 位数字服务密码"),
	E30003(30003, "请输入 6 位数字服务密码"),
	E30004(30004, "新服务密码与旧服务密码一致"),
	E30005(30005, "服务密码过于简单，请重新输入"),
	E30006(30006, "请输入 5 天前 90 天内通话过的联系人号码"),
	E30007(30007, "重置失败，请重试或拨打客服热线进行重置"),
	E30008(30008, "请输入数字服务密码");
	
	private DianHuaBangErrorCode(int code, String msg) {
		this.msg = msg;
		this.code = code;
	}
	
	private String msg;
	private int code;
	
	
	public int getCode() {
		return code;
	}

	public void setCode(int code) {
		this.code = code;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}
	
	public static String getMessage(int code) {
		for (DianHuaBangErrorCode codeEnum : DianHuaBangErrorCode.values()) {
			if (codeEnum.getCode() == code)
				return codeEnum.getMsg();
		}
		return null;
	}
}
